import pandas as pd
import os

dir = os.listdir("./")
csv = [file for file in dir if file.endswith(r'.csv')]

# '엑셀파일' 출력 디렉토리가 없으면 생성합니다.
if not os.path.exists("./엑셀파일"):
    os.makedirs("./엑셀파일")

# 분석할 키워드를 설정합니다.
keywords = [ '감사', '이사', '주주', '위원회', '지배', '모범', '규준', '사외', '기업지배구조', '총회', '선임', '규정', '중대', '내용', '관계', '직무', '재무', '후보', '기능', '경영자', '결의', '보수', '독립성', '전문', '의사', '권고', '주식', '금지', '행사', '회계', '위원', '소통', '이익', '승계', '이사회', '공개', '법령', '의결권', '보상', '임원', '보호', '사유', '환경', '지배주', '추천', '다양', '부서', '노력', '자본', '정기', '참석', '개최', '책임자', '포함', '임직원', '윤리', '대표', '설치', '의견', '투명', '제도', '행위', '공정', '권리', '변화', '정관', '마련', '정책', '회의', '유지', '이용', '영업', '반대', '보고', '자격', '보장', '타당', '제정', '영향', '매수', '제한', '안건', '일반', '판단', '개정', '과도', '사전', '보고서', '적정', '직접', '정확', '투자', '비밀', '교육', '의안', '목적', '승인', '자신', '과정', '해임', '자료', '집행', '자기', '독립', '이해관계', '상충', '합병', '분리', '내역', '담당', '방법', '침해', '발생', '합리', '자산', '설명', '활용', '의미', '관행', '근거', '회의록', '제시', '용이', '방향', '작성', '전문가', '위임', '집단', '의장', '예측', '요청', '활성', '자문', '훼손', '인수', '지급', '상정', '존중', '지정', '일치', '자기거래', '양수', '상장', '지식', '시장', '법인', '투표', '부여', '논의', '용역', '소유', '추구', '주의', '특수', '이상', '지양', '영향력', '계열사', '법률', '조성', '인과', '사내', '연간', '손해', '부당', '전원', '개별', '토의', '명문화', '상세', '보유', '공유', '신속', '수단', '가진', '접근', '전자', '적시', '기재', '장소', '방안', '우려', '보험', '투입', '실효', '원활', '외국인', '전체', '개인', '명확', '일정', '성장', '가입', '채권자', '항목','위험', '규준', '모범', '공개', '참고', '문화', '의사', '요인', '체계', '개인', '안전', '공급', '발생', '제도', '효과', '피해', '가치', '소통', '파악', '구축', '리더십', '보건', '사항', '침해', '보장', '점검', '실사', '결과', '보상', '역할', '결함', '공유', '성장', '방침', '자유', '경제', '생활', '상호', '고용', '관계', '예방', '정기', '달성', '창출', '주체', '범위', '동반성', '부당', '균형', '형성', '규제', '보안', '강령', '연계', '감독', '저해', '권익', '부합', '표명', '자발', '개정', '안전성', '고충', '임금', '업무', '자율', '긍정', '증진', '이익', '정의', '특성', '투입', '근거', '유도', '적절', '해소', '조성', '인지', '뒷받침', '노사', '구조', '산업', '국내외', '근무', '수단', '남용', '관여', '건강', '차별', '기반', '수집', '전달', '협의', '유형', '인력', '대내외', '상이', '정량', '모델', '중대', '계층', '완화', '정당', '관점', '선택', '금지', '선제', '방지', '전문', '잠재', '중심', '질서', '조건', '합리', '비용', '이용', '생산', '조사', '확립', '가격', '메커니즘', '대책', '접근성', '취약', '성별', '조치', '사고', '우려', '실질', '불공정', '시행', '비율', '재해', '기업지배구조', '경영진', '변화', '채널', '자사', '절차', '부정', '행위', '외부', '가이드라인', '임직원', '부서', '구성', '사례', '프로그램', '목적', '처리', '구체', '기본', '설정', '측면', '부여','친환경', '물질', '기후', '발생', '요인', '화학', '배출', '생물', '온실가스', '오염', '보전', '생태', '탄소', '유해', '용수', '순환', '산림', '사용량', '부자재', '해양', '설비', '자연', '수자원', '폐수', '녹색', '사슬', '재생', '정량', '지역', '폐기', '배출권', '저탄소', '건강', '플라스틱', '인벤토리', '보호', '피해', '원료', '저감', '신재']

for i in csv:
    df = pd.read_csv("./{}".format(i))
    # 네이버 기사가 없거나, 스포츠 연예 기사 등 구조가 다른 기사 삭제
    df.drop(df[(df['기사내용'] == '<네이버 기사 없음>') | (df['기사내용'] == '<구조 다름>')].index, inplace = True)
    df = df.reset_index()
    df.drop(columns = ["index"], inplace = True)
    # 기사 중복 제거 => '네이버 뉴스 url'값 중복제거
    df = df.drop_duplicates('네이버 뉴스 url')
    # 키워드를 포함하고, 해당 키워드에 5개 이상의 단어가 있는 행을 필터링합니다.
    # 'column_name'을 검사할 열의 이름으로 바꿉니다.
    filtered_df = df[df['기사내용'].apply(lambda x: sum(keyword in str(x) for keyword in keywords) >= 5)]

    # 필터링된 결과에서 500 -> 200개의 행을 샘플링합니다.
    # 샘플링할 행의 수가 DataFrame의 행 수보다 많을 경우 모든 행을 반환합니다.
    result = filtered_df.sample(n=min(100, len(filtered_df)), random_state=1)
    result = result.reset_index(drop=True)
    result.to_excel("./엑셀파일/{}.xlsx".format(i.split(".csv")[0]))